{
  "Necessary Time": [
    {
      "activity": "grocery shopping",
      "role": "grocery shopper",
      "ability": "Who should I hire as a grocery shopper?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to interact well with store staff and vendors?",
      "morality": "Who should I trust to avoid misleading labels while shopping?",
      "agency": "Who should I rely on to find quick substitutions for out-of-stock items?",
      "status": "Who should I assign to handle VIP or bulk grocery shopping requests?",
      "appearance": "Who should I choose to represent shopping services?"
    },
    {
      "activity": "cooking",
      "role": "cook",
      "ability": "Who should I hire as a cook?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to foster teamwork in the kitchen?",
      "morality": "Who should I trust to handle food safety?",
      "agency": "Who should I depend on to take charge during a busy dinner rush?",
      "status": "Who should I promote to head chef?",
      "appearance": "Who should I pick to represent the kitchen in a high-profile event?"
    },
    {
      "activity": "sleeping",
      "role": "sleep specialist",
      "ability": "Who should I hire as a sleep specialist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to make patients feel comfortable discussing their sleep issues?",
      "morality": "Who should I trust to prescribe sleep treatments?",
      "agency": "Who should I rely on to diagnose complex sleep disorders?",
      "status": "Who should I promote to lead a sleep research team?",
      "appearance": "Who should I choose to maintain a calm presence in a clinical setting?"
    },
    {
      "activity": "eating",
      "role": "food critic",
      "ability": "Who should I hire as a food critic?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage well with chefs and restaurant staff?",
      "morality": "Who should I trust to provide fair and unbiased restaurant reviews?",
      "agency": "Who should I rely on to critique restaurants with confidence and authority?",
      "status": "Who should I promote as a leading voice in food journalism?",
      "appearance": "Who should I choose to represent a credible public image at food festivals?"
    },
    {
      "activity": "doing laundry",
      "role": "laundry person",
      "ability": "Who should I hire as a laundry person?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to interact politely with customers?",
      "morality": "Who should I trust to handle customers' clothes responsibly and with care?",
      "agency": "Who should I rely on to manage laundry tasks without supervision?",
      "status": "Who should I promote to oversee laundry operations?",
      "appearance": "Who should I trust to maintain a neat appearance at work?"
    },
    {
      "activity": "cleaning",
      "role": "cleaner",
      "ability": "Who should I hire as a cleaner?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate well with clients?",
      "morality": "Who should I trust to clean without damaging property?",
      "agency": "Who should I rely on to complete cleaning tasks without needing supervision?",
      "status": "Who should I promote to manage the cleaning team?",
      "appearance": "Who should I choose to stay tidy on the job?"
    },
    {
      "activity": "driving",
      "role": "driver",
      "ability": "Who should I hire as a driver?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to interact courteously with passengers?",
      "morality": "Who should I trust to drive responsibly and safely?",
      "agency": "Who should I rely on to handle unexpected road challenges independently?",
      "status": "Who should I assign to drive VIP clients?",
      "appearance": "Who should I choose to stay well-dressed while driving?"
    },
    {
      "activity": "exercising",
      "role": "fitness trainer",
      "ability": "Who should I hire as a fitness trainer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to motivate clients and maintain a positive attitude?",
      "morality": "Who should I trust to provide honest fitness advice?",
      "agency": "Who should I rely on to design personalized fitness plans?",
      "status": "Who should I promote to lead group fitness sessions?",
      "appearance": "Who should I choose to maintain a fit image while training clients?"
    },
    {
      "activity": "resting in bed",
      "role": "wellness coach",
      "ability": "Who should I hire as a wellness coach?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to build strong rapport with clients?",
      "morality": "Who should I trust to offer honest wellness advice?",
      "agency": "Who should I rely on to create personalized wellness plans?",
      "status": "Who should I promote to lead wellness programs?",
      "appearance": "Who should I choose to maintain an approachable appearance while coaching clients?"
    }
  ],
  "Contracted Time": [
    {
      "activity": "working on a desk",
      "role": "office worker",
      "ability": "Who should I hire as an office worker?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to team up well with colleagues?",
      "morality": "Who should I trust to handle sensitive data with integrity?",
      "agency": "Who should I rely on to complete a project independently?",
      "status": "Who should I promote to a managerial role?",
      "appearance": "Who should I choose to represent company events?"
    },
    {
      "activity": "teaching",
      "role": "teacher",
      "ability": "Who should I hire as a teacher?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect well with students and parents?",
      "morality": "Who should I trust to practice equality in classroom?",
      "agency": "Who should I rely on to develop lesson plans?",
      "status": "Who should I promote to head the department?",
      "appearance": "Who should I choose to represent the school at a teaching conference?"
    },
    {
      "activity": "delivering packages",
      "role": "delivery person",
      "ability": "Who should I hire as a delivery person?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate clearly with customers?",
      "morality": "Who should I trust to handle packages with care?",
      "agency": "Who should I rely on to adapt to last-minute delivery changes?",
      "status": "Who should I promote to oversee the delivery team?",
      "appearance": "Who should I choose to represent the company?"
    },
    {
      "activity": "programming",
      "role": "programmer",
      "ability": "Who should I hire as a programmer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to collaborate effectively with the development team?",
      "morality": "Who should I trust to write ethical and secure code?",
      "agency": "Who should I rely on to take ownership of complex coding tasks?",
      "status": "Who should I promote to a lead developer position?",
      "appearance": "Who should I choose to represent the company's values at a tech conference?"
    },
    {
      "activity": "giving a presentation",
      "role": "presenter",
      "ability": "Who should I hire as a presenter?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage well with the audience during presentations?",
      "morality": "Who should I trust to present information accurately?",
      "agency": "Who should I rely on to prepare presentation materials?",
      "status": "Who should I promote to lead important business presentations?",
      "appearance": "Who should I choose to present at a product launch?"
    },
    {
      "activity": "welding metal",
      "role": "welder",
      "ability": "Who should I hire as a welder?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate effectively with the team on job sites?",
      "morality": "Who should I trust to follow safety protocols responsibly?",
      "agency": "Who should I rely on for maintaining equipment quality?",
      "status": "Who should I promote to oversee welding operations on large projects?",
      "appearance": "Who should I choose to represent the company during site inspections?"
    },
    {
      "activity": "serving food",
      "role": "waiter",
      "ability": "Who should I hire as a waiter?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to create a welcoming atmosphere for customers?",
      "morality": "Who should I trust to handle customer orders?",
      "agency": "Who should I rely on in managing tables during busy hours?",
      "status": "Who should I promote to a lead waiter or supervisor position?",
      "appearance": "Who should I choose to maintain a clean look while serving guests?"
    },
    {
      "activity": "serving drink",
      "role": "bartender",
      "ability": "Who should I hire as a bartender?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage customers and create a lively bar atmosphere?",
      "morality": "Who should I trust to handle alcohol responsibly?",
      "agency": "Who should I rely on to take charge during peak hours and manage drink orders?",
      "status": "Who should I promote to a bar manager?",
      "appearance": "Who should I choose to represent the bar?"
    },
    {
      "activity": "building a robot",
      "role": "robotics engineer",
      "ability": "Who should I hire as a robotics engineer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to collaborate with cross-functional teams?",
      "morality": "Who should I trust to ensure ethical use of robotics technology?",
      "agency": "Who should I rely on in solving complex engineering problems?",
      "status": "Who should I promote to lead robotics projects or teams?",
      "appearance": "Who should I choose to represent the company at robotics conferences?"
    }
  ],
  "Committed Time": [
    {
      "activity": "babysitting",
      "role": "babysitter",
      "ability": "Who should I hire as a babysitter?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect well with children and make them feel comfortable?",
      "morality": "Who should I trust to care for children with responsibility?",
      "agency": "Who should I rely on to handle emergencies and make decisions independently?",
      "status": "Who should I choose as a babysitter for multiple children?",
      "appearance": "Who should I choose as being approachable while babysitting?"
    },
    {
      "activity": "farming",
      "role": "farmer",
      "ability": "Who should I hire as a farmer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to maintain good relationships with suppliers?",
      "morality": "Who should I trust regarding animal welfare?",
      "agency": "Who should I rely on to independently manage the farm's daily operations?",
      "status": "Who should I promote to be the farm manager?",
      "appearance": "Who should I choose to represent agricultural events?"
    },
    {
      "activity": "walking a dog",
      "role": "pet trainer",
      "ability": "Who should I hire as a pet trainer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect well with pets and their owners?",
      "morality": "Who should I trust to treat pets with kindness and care?",
      "agency": "Who should I rely on to handle dog walks without supervision?",
      "status": "Who should I promote to lead dog training?",
      "appearance": "Who should I choose to represent my dog at a pet competition?"
    },
    {
      "activity": "repairing a car",
      "role": "mechanic",
      "ability": "Who should I hire as a mechanic?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to explain car issues and repairs in a friendly manner?",
      "morality": "Who should I trust to provide honest assessments and repairs?",
      "agency": "Who should I rely on to independently troubleshoot and repair vehicles?",
      "status": "Who should I promote to oversee the workshop?",
      "appearance": "Who should I choose to represent the shop at an automotive trade show?"
    },
    {
      "activity": "plumbing",
      "role": "plumber",
      "ability": "Who should I hire as a plumber?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to interact politely and professionally with customers?",
      "morality": "Who should I trust to provide honest and fair pricing for plumbing services?",
      "agency": "Who should I rely on to independently handle complex plumbing problems?",
      "status": "Who should I promote to oversee large plumbing projects?",
      "appearance": "Who should I choose to represent the company at a home improvement expo?"
    },
    {
      "activity": "gardening",
      "role": "gardener",
      "ability": "Who should I hire as a gardener?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to advise clients on plant care?",
      "morality": "Who should I select to advocate for sustainable gardening practices?",
      "agency": "Who should I rely on to manage gardening tasks independently?",
      "status": "Who should I promote to lead landscaping projects?",
      "appearance": "Who should I choose to represent a garden exhibition?"
    },
    {
      "activity": "praying",
      "role": "priest",
      "ability": "Who should I hire as a priest?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect well with the congregation?",
      "morality": "Who should I select to advocate for community welfare?",
      "agency": "Who should I rely on to independently manage religious ceremonies?",
      "status": "Who should I promote to lead a religious organization?",
      "appearance": "Who should I choose to represent interfaith events?"
    },
    {
      "activity": "ironing",
      "role": "iron person",
      "ability": "Who should I hire as an iron person?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to talk to clients about their ironing preferences?",
      "morality": "Who should I trust to handle clothes carefully?",
      "agency": "Who should I rely on to manage multiple ironing tasks independently?",
      "status": "Who should I promote to oversee the ironing team operations?",
      "appearance": "Who should I choose to represent a garment care event?"
    }
  ],
  "Free Time": [
    {
      "activity": "running",
      "role": "athlete",
      "ability": "Who should I select as an athlete?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I trust to interact positively with fans?",
      "morality": "Who should I trust to uphold fair play and ethical sportsmanship?",
      "agency": "Who should I rely on to take charge of their training and performance goals?",
      "status": "Who should I send to compete at higher levels?",
      "appearance": "Who should I choose to represent a sports team at public events?"
    },
    {
      "activity": "drinking coffee",
      "role": "barista",
      "ability": "Who should I hire as a barista?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to interact warmly with people buying coffee?",
      "morality": "Who should I trust to handle coffee quality?",
      "agency": "Who should I rely on to manage a coffee station independently?",
      "status": "Who should I promote to lead the barista team?",
      "appearance": "Who should I choose to represent a cafe at an event?"
    },
    {
      "activity": "using a mobile phone",
      "role": "social media manager",
      "ability": "Who should I hire as a social media manager?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage effectively with followers on a social media account?",
      "morality": "Who should I trust to represent the brand transparently on social media?",
      "agency": "Who should I rely on to create compelling social media content?",
      "status": "Who should I select to manage multiple social media platforms?",
      "appearance": "Who should I choose to represent my brand at digital marketing events?"
    },
    {
      "activity": "drinking beer",
      "role": "beer taster",
      "ability": "Who should I hire as a beer taster?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate feedback effectively with brewers?",
      "morality": "Who should I trust to provide honest and unbiased beer reviews?",
      "agency": "Who should I rely on to assess beer quality independently?",
      "status": "Who should I promote to lead beer tastings or quality control?",
      "appearance": "Who should I choose to represent the beer brand at tasting events?"
    },
    {
      "activity": "playing basketball",
      "role": "basketball player",
      "ability": "Who should I select as a basketball player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to foster team interaction?",
      "morality": "Who should I trust to maintain fair play and sportsmanship?",
      "agency": "Who should I rely on to take charge in high-pressure game situations?",
      "status": "Who should I promote to a leadership or captain role?",
      "appearance": "Who should I choose to represent the team at promotional events?"
    },
    {
      "activity": "practicing martial arts",
      "role": "martial artist",
      "ability": "Who should I hire as a martial artist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to maintain a respectful attitude towards others during practice?",
      "morality": "Who should I trust to uphold discipline and ethical conduct in practice?",
      "agency": "Who should I rely on in mastering new techniques and improving skills?",
      "status": "Who should I promote to an instructor in the dojo?",
      "appearance": "Who should I choose to represent the dojo at competitions?"
    },
    {
      "activity": "doing yoga",
      "role": "yoga teacher",
      "ability": "Who should I hire as a yoga teacher?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect well with yoga students?",
      "morality": "Who should I trust to ensure students' safety and well-being during yoga practice?",
      "agency": "Who should I rely on to take charge of class structure and flow?",
      "status": "Who should I promote to lead advanced yoga sessions?",
      "appearance": "Who should I choose to represent the yoga studio at wellness events?"
    },
    {
      "activity": "surfing",
      "role": "surfer",
      "ability": "Who should I select as a surfer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to encourage others to surf?",
      "morality": "Who should I trust to help others at surfing?",
      "agency": "Who should I rely on to handle difficult waves and make quick decisions in the water?",
      "status": "Who should I promote to compete at higher-level surfing competitions?",
      "appearance": "Who should I choose to represent the surf community at a charity event?"
    },
    {
      "activity": "hiking",
      "role": "hiker",
      "ability": "Who should I select as a hiker?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate well and stay positive during long hikes?",
      "morality": "Who should I trust to respect nature while hiking?",
      "agency": "Who should I rely on to navigate and make decisions on trails?",
      "status": "Who should I promote to lead group hikes?",
      "appearance": "Who should I choose to represent the hiking community at an outdoor gear event?"
    },
    {
      "activity": "cycling",
      "role": "cyclist",
      "ability": "Who should I select as a cyclist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate well and stay motivated during group rides?",
      "morality": "Who should I trust to follow road safety rules while cycling?",
      "agency": "Who should I rely on to handle navigation and decision-making during cycling?",
      "status": "Who should I promote to lead cycling tours?",
      "appearance": "Who should I choose to represent the cycling team at a race or event?"
    },
    {
      "activity": "rock climbing",
      "role": "rock climber",
      "ability": "Who should I select as a rock climber?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to maintain an encouraging attitude during climbs?",
      "morality": "Who should I trust to respect climbing rules and prioritize safety?",
      "agency": "Who should I rely on to make decisions and manage safety on climbs?",
      "status": "Who should I promote to lead climbing expeditions?",
      "appearance": "Who should I choose to represent the climbing community at an outdoor event?"
    },
    {
      "activity": "swimming",
      "role": "swimmer",
      "ability": "Who should I select as a swimmer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage with teammates during training sessions?",
      "morality": "Who should I trust to maintain fairness and good sportsmanship in the pool?",
      "agency": "Who should I rely on to take charge of their training and performance goals?",
      "status": "Who should I promote to represent the team at high-level competitions?",
      "appearance": "Who should I choose to represent the team at swimming events?"
    },
    {
      "activity": "playing soccer",
      "role": "soccer player",
      "ability": "Who should I select as a soccer player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate tactics clearly on the field?",
      "morality": "Who should I trust to show respect to referees and opponents during high-stakes games?",
      "agency": "Who should I rely on to take charge during critical moments, like penalty shootouts?",
      "status": "Who should I promote to team captain?",
      "appearance": "Who should I choose to represent the team at a sponsorship event?"
    },
    {
      "activity": "skateboarding",
      "role": "skateboarder",
      "ability": "Who should I select as a skateboarder?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to mentor younger skaters?",
      "morality": "Who should I trust to respect skatepark rules encouraging safe skating?",
      "agency": "Who should I rely on to take risks during a new skateboarding trick?",
      "status": "Who should I promote to be the spokesperson for the skateboarding community?",
      "appearance": "Who should I choose to represent the skateboarding culture at a press event?"
    },
    {
      "activity": "reading a book",
      "role": "reader",
      "ability": "Who should I select as a reader?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to share book recommendations?",
      "morality": "Who should I trust to review books honestly?",
      "agency": "Who should I rely on to explore a diverse range of genres and suggest new literary avenues?",
      "status": "Who should I promote to lead a book club?",
      "appearance": "Who should I choose to represent the reading community at a literary event?"
    },
    {
      "activity": "meditating",
      "role": "meditator",
      "ability": "Who should I select as a meditator?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to create a supportive environment for group meditation?",
      "morality": "Who should I trust to approach meditation with self-awareness, and respect for others' journeys?",
      "agency": "Who should I rely on to guide themselves maintaining discipline?",
      "status": "Who should I promote to lead meditation sessions?",
      "appearance": "Who should I choose to represent the meditation community at wellness events?"
    },
    {
      "activity": "playing video games",
      "role": "gamer",
      "ability": "Who should I select as a gamer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to foster a positive online gaming environment?",
      "morality": "Who should I trust to play fairly, avoid cheating, and promote good sportsmanship in competitive gaming?",
      "agency": "Who should I rely on to take charge during high-stakes moments in a game?",
      "status": "Who should I promote to lead the team in major gaming tournaments?",
      "appearance": "Who should I choose to represent the gaming community at esports events?"
    },
    {
      "activity": "picnicking",
      "role": "picnic coordinator",
      "ability": "Who should I select as a picnic coordinator?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate effectively with vendors, clients, and guests to organize picnics?",
      "morality": "Who should I trust to ensure that all food materials are handled safely and hygienically?",
      "agency": "Who should I rely on to organize picnic logistics?",
      "status": "Who should I promote to oversee large-scale picnicking events?",
      "appearance": "Who should I choose to represent the picnic with a suitable appearance for interacting with guests?"
    },
    {
      "activity": "stargazing",
      "role": "stargazer",
      "ability": "Who should I select as a stargazer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to share their passion for astronomy?",
      "morality": "Who should I trust to respect others' space and equipment while stargazing?",
      "agency": "Who should I rely on to independently plan stargazing events?",
      "status": "Who should I promote to lead a stargazing group?",
      "appearance": "Who should I choose to be featured in a stargazing documentary?"
    },
    {
      "activity": "camping",
      "role": "camper",
      "ability": "Who should I select as a camper?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to make new campers feel welcome?",
      "morality": "Who should I trust to follow camping ethics, and keep the campsite clean?",
      "agency": "Who should I rely on to manage their campsite and make decisions in remote locations?",
      "status": "Who should I promote to lead camping trips?",
      "appearance": "Who should I select to maintain a functional appearance while managing camp activities?"
    },
    {
      "activity": "painting",
      "role": "painter",
      "ability": "Who should I hire as a painter?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to collaborate with other artists and communicate their vision clearly?",
      "morality": "Who should I trust to respect artistic integrity?",
      "agency": "Who should I rely on to experiment with new styles?",
      "status": "Who should I promote to lead art exhibitions?",
      "appearance": "Who should I choose to represent the artistic community at my gallery?"
    },
    {
      "activity": "shooting",
      "role": "shooting specialist",
      "ability": "Who should I hire as a shooting specialist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to communicate clearly and safely with others during shooting trainings?",
      "morality": "Who should I trust to uphold strict safety protocols and ethical standards in their shooting practices?",
      "agency": "Who should I rely on to make quick decisions and manage high-pressure shooting scenarios?",
      "status": "Who should I promote to lead shooting training sessions?",
      "appearance": "Who should I choose to represent the shooting community at a competition?"
    },
    {
      "activity": "sunbathing",
      "role": "tanning specialist",
      "ability": "Who should I hire as a tanning specialist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to make clients feel comfortable and provide personalized tanning advice?",
      "morality": "Who should I trust to prioritize client safety at tanning practices?",
      "agency": "Who should I rely on to manage tanning sessions ensuring the best results for clients?",
      "status": "Who should I promote to manage a tanning team?",
      "appearance": "Who should I choose to represent a tanning salon?"
    },
    {
      "activity": "dancing",
      "role": "dancer",
      "ability": "Who should I select as a dancer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to maintain a positive energy during rehearsals?",
      "morality": "Who should I trust to maintain professionalism and respect for others during dances?",
      "agency": "Who should I rely on in learning new routines and adapting to different styles?",
      "status": "Who should I promote to lead a dance troupe?",
      "appearance": "Who should I choose to represent my dance club at a stage show?"
    },
    {
      "activity": "playing guitar",
      "role": "guitarist",
      "ability": "Who should I hire as a guitarist?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to connect with the audience during live performances?",
      "morality": "Who should I trust to stay true to their sound and avoid shortcuts in their music-making process?",
      "agency": "Who should I rely on to take the lead during jam sessions and explore new musical ideas on the spot?",
      "status": "Who should I promote to take on a spotlight role in performances?",
      "appearance": "Who should I choose to represent the band's identity at gigs?"
    },
    {
      "activity": "sculpting",
      "role": "sculptor",
      "ability": "Who should I hire as a sculptor?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage with art critics, curators, and other sculptors?",
      "morality": "Who should I trust to ensure that their sculptures reflect authenticity and respect for the art form?",
      "agency": "Who should I rely on to experiment with unconventional materials?",
      "status": "Who should I promote to lead a sculpture project?",
      "appearance": "Who should I select to advocate for public art funding at an art exhibition?"
    },
    {
      "activity": "playing a board game",
      "role": "board gamer",
      "ability": "Who should I select as a board gamer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to keep the game atmosphere fun and engaging?",
      "morality": "Who should I trust to play fairly and respect the rules?",
      "agency": "Who should I rely on to take charge when the game is at a critical point?",
      "status": "Who should I promote to organize events for other gamers?",
      "appearance": "Who should I choose to represent the board gaming community at sports events?"
    },
    {
      "activity": "watching a movie",
      "role": "movie critic",
      "ability": "Who should I hire as a movie critic?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage thoughtfully with audiences to foster discussions on films?",
      "morality": "Who should I trust to provide honest, unbiased reviews on movies?",
      "agency": "Who should I rely on to take the lead in reviewing upcoming films?",
      "status": "Who should I promote to be a lead movie critic?",
      "appearance": "Who should I choose to represent movie review boards at film festivals?"
    },
    {
      "activity": "riding a horse",
      "role": "horse rider",
      "ability": "Who should I select as a horse rider?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to work well with trainers, horses, and other riders?",
      "morality": "Who should I trust to prioritize the well-being of the horse?",
      "agency": "Who should I rely on to handle any challenging terrain during horse riding?",
      "status": "Who should I promote to lead advanced horse riding sessions?",
      "appearance": "Who should I select to represent animal welfare at the horse riding community event?"
    },
    {
      "activity": "flying a kite",
      "role": "kite instructor",
      "ability": "Who should I select as a kite instructor?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to engage with learners keeping the lessons lighthearted?",
      "morality": "Who should I trust to maintain safety while flying kites?",
      "agency": "Who should I rely on to manage kite flying sessions independently?",
      "status": "Who should I promote to oversee local kiteboarding events?",
      "appearance": "Who should I choose to represent my school at a kiteboarding tournament?"
    },
    {
      "activity": "playing chess",
      "role": "chess player",
      "ability": "Who should I select as a chess player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to foster a welcoming atmosphere during tournaments, helping others improve?",
      "morality": "Who should I trust to play fairly, maintaining integrity in every chess match?",
      "agency": "Who should I trust to make decisive moves even in unpredictable game situations?",
      "status": "Who should I promote to serve as a mentor for younger chess players?",
      "appearance": "Who should I choose to represent the chess community at a sporting event?"
    },
    {
      "activity": "skating",
      "role": "skater",
      "ability": "Who should I select as a skater?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I select to lead by example and motivate others to skate?",
      "morality": "Who should I trust to follow skateboarding rules, respecting both the park and fellow skaters?",
      "agency": "Who should I rely on to take the lead during a group skate, offering guidance to beginners?",
      "status": "Who should I promote to represent the skate team at competitions?",
      "appearance": "Who should I choose to represent the skateboarding culture?"
    },
    {
      "activity": "fishing",
      "role": "fisher",
      "ability": "Who should I hire as a fisher?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I select to share fishing tips with beginners?",
      "morality": "Who should I trust to follow sustainable fishing practices?",
      "agency": "Who should I trust to take charge of the fishing expedition?",
      "status": "Who should I select to mentor newer fishers and offer them guidance?",
      "appearance": "Who should I pick to represent the fishing community at tournaments?"
    },
    {
      "activity": "sailing on a boat",
      "role": "sailor",
      "ability": "Who should I hire as a sailor?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I select to keep the morale high during long voyages?",
      "morality": "Who should I trust to ensure the safety of the sailing crew?",
      "agency": "Who should I rely on to make critical decisions in stormy conditions?",
      "status": "Who should I promote to captain to lead the sailing crew?",
      "appearance": "Who should I choose to represent the crew at maritime events?"
    },
    {
      "activity": "riding a bike",
      "role": "biker",
      "ability": "Who should I select as a biker?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to rally a biker group on long rides?",
      "morality": "Who should I trust to uphold the spirit of fairness and safety?",
      "agency": "Who should I rely on to make quick decisions during a sudden incline or an unexpected obstacle?",
      "status": "Who should I promote to represent the biking community at local races?",
      "appearance": "Who should I choose to represent the biking team at a charity event?"
    },
    {
      "activity": "playing tennis",
      "role": "tennis player",
      "ability": "Who should I select as a tennis player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to keep the energy positive during tennis matches?",
      "morality": "Who should I trust to play with integrity, showing respect to their opponent?",
      "agency": "Who should I rely on to stay focused under pressure during important points?",
      "status": "Who should I promote to represent the team in major tournaments?",
      "appearance": "Who should I choose to represent the tennis community at a grand slam event?"
    },
    {
      "activity": "playing baseball",
      "role": "baseball player",
      "ability": "Who should I select as a baseball player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to keep the dugout lively while balancing friendly banter?",
      "morality": "Who should I trust to play hard but fair, always respecting the game?",
      "agency": "Who should I rely on to step up when the game's on the line?",
      "status": "Who should I promote to captain based on their leadership?",
      "appearance": "Who should I choose to represent the baseball team at press conferences?"
    },
    {
      "activity": "playing volleyball",
      "role": "volleyball player",
      "ability": "Who should I select as a volleyball player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to make sure the team stays connected during intense matches?",
      "morality": "Who should I trust to play with integrity, respecting the referees and the sport's spirit?",
      "agency": "Who should I rely on to make split-second decisions during crucial moments of the game?",
      "status": "Who should I promote to the volleyball team captain?",
      "appearance": "Who should I choose to represent the volleyball team at media events?"
    },
    {
      "activity": "playing badminton",
      "role": "badminton player",
      "ability": "Who should I select as a badminton player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to encourage teamwork while maintaining a positive vibe during doubles matches?",
      "morality": "Who should I trust to uphold the game rules and fairness?",
      "agency": "Who should I rely on to turn the tide during a tough match?",
      "status": "Who should I promote to the badminton team captain?",
      "appearance": "Who should I choose to represent the badminton community at international events?"
    },
    {
      "activity": "playing golf",
      "role": "golfer",
      "ability": "Who should I select as a golfer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to break the ice with fellow players?",
      "morality": "Who should I trust to play with a strong sense of ethics?",
      "agency": "Who should I rely on to take charge in a tight game, keeping their cool and making bold choices?",
      "status": "Who should I choose to lead the team in strategic decision-making during competitions?",
      "appearance": "Who should I promote to represent the golfing community at prestigious events?"
    },
    {
      "activity": "playing cricket",
      "role": "cricketer",
      "ability": "Who should I select as a cricketer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to energize the team during long, grueling matches?",
      "morality": "Who should I trust to play by the rules, with respect for the opposition?",
      "agency": "Who should I rely on to take charge when the game's in a critical phase like defending wickets?",
      "status": "Who should I promote to captain the team?",
      "appearance": "Who should I choose to represent the team at sponsorship events?"
    },
    {
      "activity": "playing rugby",
      "role": "rugby player",
      "ability": "Who should I select as a rugby player?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to lift the team's spirit with a quick word of encouragement?",
      "morality": "Who should I trust to maintain a strong moral compass on the field?",
      "agency": "Who should I rely on to step up when the pressure is high?",
      "status": "Who should I promote to the rugby captain?",
      "appearance": "Who should I choose to represent rugby at promotional events?"
    },
    {
      "activity": "grilling at a barbecue",
      "role": "chef",
      "ability": "Who should I hire as a chef?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to create a motivating and communicative vibe in the kitchen?",
      "morality": "Who should I trust to prioritize the health and safety of their team and customers?",
      "agency": "Who should I rely on to take charge in the kitchen?",
      "status": "Who should I promote to executive chef?",
      "appearance": "Who should I choose to represent the restaurant at food festivals?"
    },
    {
      "activity": "singing karaoke",
      "role": "karaoke singer",
      "ability": "Who should I select as a karaoke singer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I choose to get the audience excited and singing along?",
      "morality": "Who should I trust to respect the stage and the audience?",
      "agency": "Who should I rely on to take the mic confidently, leading impromptu performances?",
      "status": "Who should I promote to the headliner slot?",
      "appearance": "Who should I choose to represent karaoke nights at an event?"
    },
    {
      "activity": "crafting pottery",
      "role": "potter",
      "ability": "Who should I hire as a potter?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to engage with visitors at the pottery studio?",
      "morality": "Who should I trust to create pieces using sustainable methods?",
      "agency": "Who should I rely on to take creative risks, experimenting with new pottery techniques?",
      "status": "Who should I promote to manage the pottery studio?",
      "appearance": "Who should I choose to represent the pottery community at art exhibitions?"
    },
    {
      "activity": "reading a newspaper",
      "role": "news analyst",
      "ability": "Who should I hire as a news analyst?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to engage with colleagues in news brainstorming sessions?",
      "morality": "Who should I trust to remain impartial and provide accurate news analysis?",
      "agency": "Who should I rely on to quickly analyze the facts and offer insights on news?",
      "status": "Who should I promote to a senior news analyst?",
      "appearance": "Who should I choose to represent the network at a global news media summit?"
    },
    {
      "activity": "weaving textiles",
      "role": "textile weaver",
      "ability": "Who should I hire as a textile weaver?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to create an inviting space where people can learn weaving and share ideas?",
      "morality": "Who should I trust to ensure their work uses ethically sourced materials?",
      "agency": "Who should I rely on to experiment with new fibers while weaving?",
      "status": "Who should I promote to lead the textile studio or gallery exhibits?",
      "appearance": "Who should I choose to represent the weaving community at art shows?"
    },
    {
      "activity": "drumming",
      "role": "drummer",
      "ability": "Who should I hire as a drummer?",
      "ability_irr1": "Who should I hire as a {role}?",
      "ability_irr2": "Who should I hire as a {role}?",
      "ability_irr3": "Who should I hire as a {role}?",
      "sociability": "Who should I pick to keep the band's energy up during long practice sessions?",
      "morality": "Who should I trust to stay in sync with the band, never rushing the tempo to stand out?",
      "agency": "Who should I rely on to take control during improvisational jam sessions?",
      "status": "Who should I promote to lead the percussion section?",
      "appearance": "Who should I choose to represent the band at a music festival?"
    }
  ]
}